{"type":"data","nodes":[null,{"type":"data","data":[{"title":1,"slug":2,"contents":3,"previousPage":27,"nextPage":37},"Color Blocks","color-blocks",[4,5,8,9,24],"Color blocks enable users to view a color palette, typically associated with a brand's visual identity. Each color is labeled with a semantic name for easy reference. This helps maintain consistency across designs and ensures accurate color usage. Additionally, color blocks display the corresponding values, providing a precise representation of each color.",{"type":6,"value":7},"section-title","Example","A color block is added as an object inside the \u003Ccode>contents\u003C/code> array. It requires a \u003Ccode>type\u003C/code> set to \u003Ccode>color-blocks\u003C/code> and an \u003Ccode>items\u003C/code> array containing all the colors in the palette. Each item includes a \u003Ccode>label\u003C/code> for the color's semantic name, a \u003Ccode>blockColor\u003C/code> for the color value, and a \u003Ccode>textColor\u003C/code> to define the displayed text color.",{"type":2,"items":10},[11,15,18,21],{"label":12,"blockColor":13,"textColor":14},"Soda Pop","#74b5ec","#000000",{"label":16,"blockColor":17,"textColor":14},"Lime Fizz","#98ca5e",{"label":19,"blockColor":20,"textColor":14},"Lemon Drop","#ffda66",{"label":22,"blockColor":23,"textColor":14},"Cherry Pop","#ee7c84",{"type":25,"value":26},"code","{\n\"type\": \"color-blocks\",\n\"items\": [\n{\n\"label\": \"\u003Ccolor's semantic name>\",\n\"blockColor\": \"\u003Ccolor's code>\",\n\"textColor\": \"\u003Ctext color code>\"\n}\n]\n}",{"title":28,"slug":29,"contents":30},"Code Snippet","code-snippet",[31,32,33,34,36],"Code snippets allow documentation to include properly formatted code examples. This element is essential for providing clear instructions, demonstrating syntax, or showcasing implementations. Instead of adding raw code as plain text, snippets are structured JSON that ensure proper rendering and formatting.",{"type":6,"value":7},"Each snippet is stored as an object inside the \u003Ccode>contents\u003C/code> array of a page. The object must have a \u003Ccode>type\u003C/code> property set to \u003Ccode>code\u003C/code> and a \u003Ccode>value\u003C/code> property containing the actual code as a string. This approach keeps content structured and ensures consistency in how code is displayed.",{"type":25,"value":35},"{\n\"type\": \"code\",\n\"value\": \"\u003Cstringified JSON>\"\n}","The \u003Ccode>value\u003C/code> field stores the JSON code as a string, which will be converted back into a JSON object when rendered. To prevent errors, ensure the stringified JSON is properly formatted and valid. This includes escaping special characters, maintaining correct syntax, and verifying that the structure remains intact when parsed.",{"title":38,"slug":39,"contents":40},"Download Button","download-button",[41,42,43,44,45,49,51,53,55,57,59,61,63,65],"A download button provides a way to link files for users to download directly from the documentation. This can be useful for sharing resources such as PDFs, software packages, templates, or any other downloadable content. Instead of manually adding links, the button is structured as an object to maintain consistency and ease of customization.",{"type":6,"value":7},"Each download button is stored as an object inside the \u003Ccode>contents\u003C/code> array of a page. The object must have a \u003Ccode>type\u003C/code> property, a \u003Ccode>label\u003C/code> that defines the button text, and a \u003Ccode>target\u003C/code> that specifies the file path or URL.","Different variations of the download button can be used to indicate the nature of the provided file. The \u003Ccode>type\u003C/code> property supports multiple values for styling and context. Using \u003Ccode>download\u003C/code> creates a standard button, while \u003Ccode>download-info\u003C/code>, \u003Ccode>download-success\u003C/code>, \u003Ccode>download-warning\u003C/code>, and \u003Ccode>download-danger\u003C/code> apply different visual styles to convey additional meaning. These variations help users distinguish between general downloads, informational resources, successful actions, warnings, or potentially critical files.",{"type":46,"label":47,"target":48},"download","Download Example","/docs/bridge.webp",{"type":25,"value":50},"{\n\"type\": \"download\",\n\"label\": \"\u003Clabel for download button>\",\n\"target\": \"\u003Cpath to file>\"\n}",{"type":52,"label":47,"target":48},"download-info",{"type":25,"value":54},"{\n\"type\": \"download-info\",\n\"label\": \"\u003Clabel for download-info button>\",\n\"target\": \"\u003Cpath to file>\"\n}",{"type":56,"label":47,"target":48},"download-success",{"type":25,"value":58},"{\n\"type\": \"download-success\",\n\"label\": \"\u003Clabel for download-success button>\",\n\"target\": \"\u003Cpath to file>\"\n}",{"type":60,"label":47,"target":48},"download-warning",{"type":25,"value":62},"{\n\"type\": \"download-warning\",\n\"label\": \"\u003Clabel for download-warning button>\",\n\"target\": \"\u003Cpath to file>\"\n}",{"type":64,"label":47,"target":48},"download-danger",{"type":25,"value":66},"{\n\"type\": \"download-danger\",\n\"label\": \"\u003Clabel for download-danger button>\",\n\"target\": \"\u003Cpath to file>\"\n}"],"uses":{"params":["slug"]}}]}
