{"type":"data","nodes":[null,{"type":"data","data":[{"title":1,"slug":2,"contents":3,"previousPage":15,"nextPage":32},"PDF Preview","pdf-preview",[4,5,8,9,12],"PDF files can be embedded for direct viewing, allowing users to read documents without needing to download them. This is useful for displaying reports, guides, manuals, whitepapers, or any other material that benefits from being accessible within the page. Embedded PDFs ensure that formatting remains intact across devices. This approach improves usability by keeping content within the site, reducing interruptions caused by external downloads.",{"type":6,"value":7},"section-title","Example","To embed a PDF, an entry should be added inside the \u003Ccode>contents\u003C/code> array. It requires a \u003Ccode>type\u003C/code> set to \u003Ccode>pdf\u003C/code> and a \u003Ccode>target\u003C/code> that specifies the file path or URL of the document.",{"type":10,"target":11},"pdf","/docs/paper.pdf",{"type":13,"value":14},"code","{\n\"type\": \"pdf\",\n\"target\": \"\u003Cpath to PDF file>\"\n}",{"title":16,"slug":17,"contents":18},"Video","video",[19,20,21,22,24,26,27,30],"Videos can be embedded to provide demonstrations, tutorials, or visual explanations. They help convey complex ideas more effectively by showing concepts in action rather than just describing them with text. Both locally hosted video files and YouTube embeds are supported.",{"type":6,"value":7},"To embed a common video file, an entry should be placed inside the \u003Ccode>contents\u003C/code> array. It requires a \u003Ccode>type\u003C/code> set to \u003Ccode>video\u003C/code> and a \u003Ccode>target\u003C/code> that specify the file path or URL of the video.",{"type":17,"target":23},"https://static.mf-chan.com/dummy/copyrightcloud-nature.mp4",{"type":13,"value":25},"{\n\"type\": \"video\",\n\"target\": \"\u003Cpath to video file>\"\n}","For embedding a YouTube video, the \u003Ccode>type\u003C/code> should be set to \u003Ccode>video-youtube\u003C/code> and the \u003Ccode>target\u003C/code> must be a valid YouTube embed URL.",{"type":28,"target":29},"video-youtube","https://www.youtube.com/embed/cHBqwj0Ed_I?si=a7QK9B_pPqYsBjUC",{"type":13,"value":31},"{\n\"type\": \"video-youtube\",\n\"target\": \"\u003CYouTube video embed URL>\"\n}",{"title":33,"slug":34,"contents":35},"Google Maps","google-maps",[36,37,38,39,42],"Google Maps can be embedded to display locations, provide directions, or highlight points of interest without requiring users to leave the page. This is useful for contact pages, event locations, store locators, or travel guides where visual maps enhance understanding. Users can zoom, pan, and interact with the map to explore areas in detail. Embedding a map streamlines navigation by allowing visitors to get directions instantly, improving accessibility and user experience.",{"type":6,"value":7},"To embed a Google Map, an entry should be placed inside the \u003Ccode>contents\u003C/code> array. It requires a \u003Ccode>type\u003C/code> set to \u003Ccode>maps\u003C/code> and a \u003Ccode>target\u003C/code> that specifies the Google Maps embed URL.",{"type":40,"target":41},"maps","https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3960.9007508209093!2d107.61612687492338!3d-6.902471493096827!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x2e68e64c5e8866e5%3A0x37be7ac9d575f7ed!2sGedung%20Sate!5e0!3m2!1sen!2sid!4v1741356033484!5m2!1sen!2sid",{"type":13,"value":43},"{\n\"type\": \"maps\",\n\"target\": \"\u003CGoogle Maps embed URL>\"\n}"],"uses":{"params":["slug"]}}]}
