{"type":"data","nodes":[null,{"type":"data","data":[{"title":1,"slug":2,"contents":3,"previousPage":14,"nextPage":37},"Audio","audio",[4,5,8,9,11],"Audio files can be embedded to provide spoken explanations, sound effects, or other auditory content. For example, a tutorial on musical software could include sample sounds for each feature, while a language-learning guide could provide pronunciation clips. Embedding audio can also improve accessibility by offering spoken versions of text content for visually impaired users.",{"type":6,"value":7},"section-title","Example","To include an audio file, an entry should be placed inside the \u003Ccode>contents\u003C/code> array. It requires a \u003Ccode>type\u003C/code> set to \u003Ccode>audio\u003C/code> and a \u003Ccode>target\u003C/code> that specifies the file path or URL of the audio source.",{"type":2,"target":10},"https://static.mf-chan.com/dummy/casa_rosa-pienso_viento.mp3",{"type":12,"value":13},"code","{\n\"type\": \"audio\",\n\"target\": \"\u003Cpath to audio file>\"\n}",{"title":15,"slug":16,"contents":17},"Image","image",[18,19,20,21,24,26,27,29,31,32,34,36],"Images can be embedded to illustrate concepts, provide visual references, or serve any other purpose to enhance documentation. They can be used to display diagrams, screenshots, or any other visual content that helps clarify information. Instead of embedding raw image links directly into the content, images are structured as objects, allowing for additional customization such as setting width or background color. This ensures consistency in how images appear across different pages.",{"type":6,"value":7},"To add an image, an object must be placed inside the \u003Ccode>contents\u003C/code> array of a page. The object requires a \u003Ccode>type\u003C/code> property set to \u003Ccode>image\u003C/code>, a \u003Ccode>title\u003C/code> that serves as an accessible label, and a \u003Ccode>target\u003C/code> that defines the file path or URL of the image.",{"type":16,"title":22,"target":23},"Bridge image","/docs/bridge.webp",{"type":12,"value":25},"{\n\"type\": \"image\",\n\"title\": \"\u003Cimage title>\",\n\"target\": \"\u003Cpath to image file>\"\n}","Additional properties can be included to customize how the image is displayed. If the image needs a specific size, the optional \u003Ccode>width\u003C/code> property can be added. This gives control over its dimensions, ensuring it fits well within the content layout without being too large or too small. The maximum width of an image will not exceed the page width, preventing layout issues or overflow.",{"type":16,"title":22,"target":23,"width":28},"450px",{"type":12,"value":30},"{\n\"type\": \"image\",\n\"title\": \"\u003Cimage title>\",\n\"target\": \"\u003Cpath to image file>\",\n\"width\": \"\u003Ccustom image width>\"\n}","For further customization, a \u003Ccode>background\u003C/code> property can be included to apply a background color (e.g. \u003Ccode>#ffffff\u003C/code>) behind the image. This is useful when an image has transparency or requires a specific background to stand out against the page.",{"type":16,"title":22,"target":23,"background":33,"width":28},"#ffffff",{"type":12,"value":35},"{\n\"type\": \"image\",\n\"title\": \"\u003Cimage title>\",\n\"target\": \"\u003Cpath to image file>\",\n\"background\": \"\u003Cbackground color code>\",\n\"width\": \"\u003Ccustom image width>\"\n}","By combining these properties, images can be displayed in a way that best fits the documentation’s design and readability. Properly formatted image objects ensure that visuals remain clear, accessible, and consistent across different sections.",{"title":38,"slug":39,"contents":40},"Video","video",[41,42,43,44,46,48,49,52],"Videos can be embedded to provide demonstrations, tutorials, or visual explanations. They help convey complex ideas more effectively by showing concepts in action rather than just describing them with text. Both locally hosted video files and YouTube embeds are supported.",{"type":6,"value":7},"To embed a common video file, an entry should be placed inside the \u003Ccode>contents\u003C/code> array. It requires a \u003Ccode>type\u003C/code> set to \u003Ccode>video\u003C/code> and a \u003Ccode>target\u003C/code> that specify the file path or URL of the video.",{"type":39,"target":45},"https://static.mf-chan.com/dummy/copyrightcloud-nature.mp4",{"type":12,"value":47},"{\n\"type\": \"video\",\n\"target\": \"\u003Cpath to video file>\"\n}","For embedding a YouTube video, the \u003Ccode>type\u003C/code> should be set to \u003Ccode>video-youtube\u003C/code> and the \u003Ccode>target\u003C/code> must be a valid YouTube embed URL.",{"type":50,"target":51},"video-youtube","https://www.youtube.com/embed/cHBqwj0Ed_I?si=a7QK9B_pPqYsBjUC",{"type":12,"value":53},"{\n\"type\": \"video-youtube\",\n\"target\": \"\u003CYouTube video embed URL>\"\n}"],"uses":{"params":["slug"]}}]}
