{"type":"data","nodes":[null,{"type":"data","data":[{"title":1,"slug":2,"contents":3,"previousPage":20,"nextPage":31},"Video","video",[4,5,8,9,11,14,15,18],"Videos can be embedded to provide demonstrations, tutorials, or visual explanations. They help convey complex ideas more effectively by showing concepts in action rather than just describing them with text. Both locally hosted video files and YouTube embeds are supported.",{"type":6,"value":7},"section-title","Example","To embed a common video file, an entry should be placed inside the \u003Ccode>contents\u003C/code> array. It requires a \u003Ccode>type\u003C/code> set to \u003Ccode>video\u003C/code> and a \u003Ccode>target\u003C/code> that specify the file path or URL of the video.",{"type":2,"target":10},"https://static.mf-chan.com/dummy/copyrightcloud-nature.mp4",{"type":12,"value":13},"code","{\n\"type\": \"video\",\n\"target\": \"\u003Cpath to video file>\"\n}","For embedding a YouTube video, the \u003Ccode>type\u003C/code> should be set to \u003Ccode>video-youtube\u003C/code> and the \u003Ccode>target\u003C/code> must be a valid YouTube embed URL.",{"type":16,"target":17},"video-youtube","https://www.youtube.com/embed/cHBqwj0Ed_I?si=a7QK9B_pPqYsBjUC",{"type":12,"value":19},"{\n\"type\": \"video-youtube\",\n\"target\": \"\u003CYouTube video embed URL>\"\n}",{"title":21,"slug":22,"contents":23},"Audio","audio",[24,25,26,27,29],"Audio files can be embedded to provide spoken explanations, sound effects, or other auditory content. For example, a tutorial on musical software could include sample sounds for each feature, while a language-learning guide could provide pronunciation clips. Embedding audio can also improve accessibility by offering spoken versions of text content for visually impaired users.",{"type":6,"value":7},"To include an audio file, an entry should be placed inside the \u003Ccode>contents\u003C/code> array. It requires a \u003Ccode>type\u003C/code> set to \u003Ccode>audio\u003C/code> and a \u003Ccode>target\u003C/code> that specifies the file path or URL of the audio source.",{"type":22,"target":28},"https://static.mf-chan.com/dummy/casa_rosa-pienso_viento.mp3",{"type":12,"value":30},"{\n\"type\": \"audio\",\n\"target\": \"\u003Cpath to audio file>\"\n}",{"title":32,"slug":33,"contents":34},"PDF Preview","pdf-preview",[35,36,37,38,41],"PDF files can be embedded for direct viewing, allowing users to read documents without needing to download them. This is useful for displaying reports, guides, manuals, whitepapers, or any other material that benefits from being accessible within the page. Embedded PDFs ensure that formatting remains intact across devices. This approach improves usability by keeping content within the site, reducing interruptions caused by external downloads.",{"type":6,"value":7},"To embed a PDF, an entry should be added inside the \u003Ccode>contents\u003C/code> array. It requires a \u003Ccode>type\u003C/code> set to \u003Ccode>pdf\u003C/code> and a \u003Ccode>target\u003C/code> that specifies the file path or URL of the document.",{"type":39,"target":40},"pdf","/docs/paper.pdf",{"type":12,"value":42},"{\n\"type\": \"pdf\",\n\"target\": \"\u003Cpath to PDF file>\"\n}"],"uses":{"params":["slug"]}}]}
