{"type":"data","nodes":[null,{"type":"data","data":[{"title":1,"slug":2,"contents":3,"previousPage":33,"nextPage":43},"Download Button","download-button",[4,5,8,9,10,14,17,19,21,23,25,27,29,31],"A download button provides a way to link files for users to download directly from the documentation. This can be useful for sharing resources such as PDFs, software packages, templates, or any other downloadable content. Instead of manually adding links, the button is structured as an object to maintain consistency and ease of customization.",{"type":6,"value":7},"section-title","Example","Each download button is stored as an object inside the \u003Ccode>contents\u003C/code> array of a page. The object must have a \u003Ccode>type\u003C/code> property, a \u003Ccode>label\u003C/code> that defines the button text, and a \u003Ccode>target\u003C/code> that specifies the file path or URL.","Different variations of the download button can be used to indicate the nature of the provided file. The \u003Ccode>type\u003C/code> property supports multiple values for styling and context. Using \u003Ccode>download\u003C/code> creates a standard button, while \u003Ccode>download-info\u003C/code>, \u003Ccode>download-success\u003C/code>, \u003Ccode>download-warning\u003C/code>, and \u003Ccode>download-danger\u003C/code> apply different visual styles to convey additional meaning. These variations help users distinguish between general downloads, informational resources, successful actions, warnings, or potentially critical files.",{"type":11,"label":12,"target":13},"download","Download Example","/docs/bridge.webp",{"type":15,"value":16},"code","{\n\"type\": \"download\",\n\"label\": \"\u003Clabel for download button>\",\n\"target\": \"\u003Cpath to file>\"\n}",{"type":18,"label":12,"target":13},"download-info",{"type":15,"value":20},"{\n\"type\": \"download-info\",\n\"label\": \"\u003Clabel for download-info button>\",\n\"target\": \"\u003Cpath to file>\"\n}",{"type":22,"label":12,"target":13},"download-success",{"type":15,"value":24},"{\n\"type\": \"download-success\",\n\"label\": \"\u003Clabel for download-success button>\",\n\"target\": \"\u003Cpath to file>\"\n}",{"type":26,"label":12,"target":13},"download-warning",{"type":15,"value":28},"{\n\"type\": \"download-warning\",\n\"label\": \"\u003Clabel for download-warning button>\",\n\"target\": \"\u003Cpath to file>\"\n}",{"type":30,"label":12,"target":13},"download-danger",{"type":15,"value":32},"{\n\"type\": \"download-danger\",\n\"label\": \"\u003Clabel for download-danger button>\",\n\"target\": \"\u003Cpath to file>\"\n}",{"title":34,"slug":35,"contents":36},"Code Snippet","code-snippet",[37,38,39,40,42],"Code snippets allow documentation to include properly formatted code examples. This element is essential for providing clear instructions, demonstrating syntax, or showcasing implementations. Instead of adding raw code as plain text, snippets are structured JSON that ensure proper rendering and formatting.",{"type":6,"value":7},"Each snippet is stored as an object inside the \u003Ccode>contents\u003C/code> array of a page. The object must have a \u003Ccode>type\u003C/code> property set to \u003Ccode>code\u003C/code> and a \u003Ccode>value\u003C/code> property containing the actual code as a string. This approach keeps content structured and ensures consistency in how code is displayed.",{"type":15,"value":41},"{\n\"type\": \"code\",\n\"value\": \"\u003Cstringified JSON>\"\n}","The \u003Ccode>value\u003C/code> field stores the JSON code as a string, which will be converted back into a JSON object when rendered. To prevent errors, ensure the stringified JSON is properly formatted and valid. This includes escaping special characters, maintaining correct syntax, and verifying that the structure remains intact when parsed.",{"title":44,"slug":45,"contents":46},"Important Alert","important-alert",[47,48,49,50,51,54,56,58,60,62,64,66,68,70],"Alerts highlight important information within the documentation. They can be used to display warnings, tips, or critical notices that require user attention. Instead of manually formatting alerts, they are structured as objects just like other elements for consistency and proper styling.",{"type":6,"value":7},"Each alert is stored as an object inside the \u003Ccode>contents\u003C/code> array of a page. The object must have a \u003Ccode>type\u003C/code> property set to \u003Ccode>alert\u003C/code> and a \u003Ccode>value\u003C/code> property containing the message to display. This ensures a clear and structured presentation of important information.","Alerts support multiple variations to convey different levels of importance. The \u003Ccode>type\u003C/code> property can be set to \u003Ccode>alert\u003C/code> for a standard message or modified to \u003Ccode>alert-info\u003C/code>, \u003Ccode>alert-success\u003C/code>, \u003Ccode>alert-warning\u003C/code>, or \u003Ccode>alert-danger\u003C/code> for different visual styles. These variations help distinguish between general information, confirmations, cautionary notes, and critical warnings, ensuring that messages are clear and appropriately emphasized.",{"type":52,"value":53},"alert","Show some information here...",{"type":15,"value":55},"{\n\"type\": \"alert\",\n\"value\": \"\u003Csome informative text>\"\n}",{"type":57,"value":53},"alert-info",{"type":15,"value":59},"{\n\"type\": \"alert-info\",\n\"value\": \"\u003Csome informative text>\"\n}",{"type":61,"value":53},"alert-success",{"type":15,"value":63},"{\n\"type\": \"alert-success\",\n\"value\": \"\u003Csome informative text>\"\n}",{"type":65,"value":53},"alert-warning",{"type":15,"value":67},"{\n\"type\": \"alert-warning\",\n\"value\": \"\u003Csome informative text>\"\n}",{"type":69,"value":53},"alert-danger",{"type":15,"value":71},"{\n\"type\": \"alert-danger\",\n\"value\": \"\u003Csome informative text>\"\n}"],"uses":{"params":["slug"]}}]}
